-- *********************************************************************************************************
-- author: zhouchangyue
-- QQ:   23199412
-- 错误类型定义
-- *********************************************************************************************************

local err = { msg = {} }

----用户输入格式错误
err.USERINPUTFORMAT = -100100

----用户输入逻辑错误
err.USERINPUTLOGICAL = -100200


----服务后台错误
err.SERVER = -100300


----系统错误
err.SYSTEM = -100301


----数据库读写错误
err.DBIO = -100400


----数据库逻辑错误
err.DBNORECORDS = -100401


----认证失败
err.AUTHFAIL = -100500


----系统繁忙
err.SYSTEM_BUSY = -100600


return err

